# 0 дождя не будет
# 1 дождь будет
# в консоль пишется ваше имя если ваше имя admin то
# вывести добро пожаловать а если нет то вывести
# ошибка
is_rain = 4
if is_rain == 1:
    print("возьми зонт")
    print("это было первое условие")
print("идем дальше")
if is_rain != 1:
    print("не бери зонт")
    print("это было второе условие")
print("конец")


# условие1 если is_rain = 1 -> print("возьми зонт")
# условие2 если is_rain = 0 -> print("зонт не нужен")
# if условие1:
#     print("возьми зонт")
#     print("условие1 выполнилось")
# print("sdsddsd")
#
# if условие2:
#     print("зонт не нужен")
# >,<,>=,<=,!=,==
# a = 3
# b = 4
# c = a > b#False -> ложь
# d = a < b#True -> истина
# e = a == b
# f = a != b
# print(c)
# print(d)
# print(e)
# print(f)