# Есть список a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89].
# Выведите все элементы, которые меньше 5.
# Ответ: 1 1 2 3

arr = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
i = 0
end = len(arr)
while i<end:
    if arr[i]<5:
        print(arr[i])
    i+=1